# NOTE: inplace = True
- it modifies the original data frame values.

# Adding column in dataframe
- this method will add new column at the end of the table.
    - df["column_name"] = some data 
- Adding a new column at a specific  position.
    - df.insert(loc, "column_name', 'data')

In [23]:
import pandas as pd

In [24]:
data ={
    'Name': ['ram', 'syam','rahul','mohit', 'susheel','ajay','satyam','naveen', 'anshika', 'pranjali', 'akhand', 'ankanksha','sneha'],
    "Age": [21,22,32,23,34,25,35,22,23,52,22,25,23],
    "salary": [45000,23000,45000,12000,50000,42000,52000,51000,55000,48000,48000,49000,51000]
    }

In [25]:
df = pd.DataFrame(data)
df.to_csv("data.csv", index= False )
print(df)

         Name  Age  salary
0         ram   21   45000
1        syam   22   23000
2       rahul   32   45000
3       mohit   23   12000
4     susheel   34   50000
5        ajay   25   42000
6      satyam   35   52000
7      naveen   22   51000
8     anshika   23   55000
9    pranjali   52   48000
10     akhand   22   48000
11  ankanksha   25   49000
12      sneha   23   51000

In [26]:
df['Department'] = ['IT', 'Data Analysis', 'Costomer Support', 'Sales','Marketing','IT', 'Data Analysis', 'Costomer Support', 'Sales','Marketing','Sales','Marketing','IT']
print(df)

         Name  Age  salary        Department
0         ram   21   45000                IT
1        syam   22   23000     Data Analysis
2       rahul   32   45000  Costomer Support
3       mohit   23   12000             Sales
4     susheel   34   50000         Marketing
5        ajay   25   42000                IT
6      satyam   35   52000     Data Analysis
7      naveen   22   51000  Costomer Support
8     anshika   23   55000             Sales
9    pranjali   52   48000         Marketing
10     akhand   22   48000             Sales
11  ankanksha   25   49000         Marketing
12      sneha   23   51000                IT

In [27]:
employee_ID = ['EMP001','EMP002','EMP003','EMP004','EMP005','EMP006','EMP007','EMP008','EMP009','EMP010','EMP011','EMP012','EMP013']
df.insert(0, "Employee ID", employee_ID) # Inserted a 'new_column' at index 0 named "employee_ID"
print(df)

   Employee ID       Name  Age  salary        Department
0       EMP001        ram   21   45000                IT
1       EMP002       syam   22   23000     Data Analysis
2       EMP003      rahul   32   45000  Costomer Support
3       EMP004      mohit   23   12000             Sales
4       EMP005    susheel   34   50000         Marketing
5       EMP006       ajay   25   42000                IT
6       EMP007     satyam   35   52000     Data Analysis
7       EMP008     naveen   22   51000  Costomer Support
8       EMP009    anshika   23   55000             Sales
9       EMP010   pranjali   52   48000         Marketing
10      EMP011     akhand   22   48000             Sales
11      EMP012  ankanksha   25   49000         Marketing
12      EMP013      sneha   23   51000                IT

# Updating value in data frame
- Updating a cell of data frame.
    - df.loc[index_no, "column_name"] = data
- Updating a whole column.
    - df['column_name'] = updated_data
- Removing column and row
   - df.drop[column = ["column_name", 'column_name_2', '...'], inplace = True] # Removing a column
   -

In [28]:
df.loc[1, 'salary'] = 25000 # updating the salary of 'syam' from 23000 to 25000.
print(df)

   Employee ID       Name  Age  salary        Department
0       EMP001        ram   21   45000                IT
1       EMP002       syam   22   25000     Data Analysis
2       EMP003      rahul   32   45000  Costomer Support
3       EMP004      mohit   23   12000             Sales
4       EMP005    susheel   34   50000         Marketing
5       EMP006       ajay   25   42000                IT
6       EMP007     satyam   35   52000     Data Analysis
7       EMP008     naveen   22   51000  Costomer Support
8       EMP009    anshika   23   55000             Sales
9       EMP010   pranjali   52   48000         Marketing
10      EMP011     akhand   22   48000             Sales
11      EMP012  ankanksha   25   49000         Marketing
12      EMP013      sneha   23   51000                IT

In [29]:
df['salary'] = df['salary'] + (df['salary'] * 0.2) # incresing the salary of each person  by 2%.
print(df)

   Employee ID       Name  Age   salary        Department
0       EMP001        ram   21  54000.0                IT
1       EMP002       syam   22  30000.0     Data Analysis
2       EMP003      rahul   32  54000.0  Costomer Support
3       EMP004      mohit   23  14400.0             Sales
4       EMP005    susheel   34  60000.0         Marketing
5       EMP006       ajay   25  50400.0                IT
6       EMP007     satyam   35  62400.0     Data Analysis
7       EMP008     naveen   22  61200.0  Costomer Support
8       EMP009    anshika   23  66000.0             Sales
9       EMP010   pranjali   52  57600.0         Marketing
10      EMP011     akhand   22  57600.0             Sales
11      EMP012  ankanksha   25  58800.0         Marketing
12      EMP013      sneha   23  61200.0                IT

# Detecting a missing data in dataframe.
Data frame denotes the missing in two ways-
- NAN (Not a Number)
- None (for  object data type)

Finding for the missing data.
- df.isnull() # Returns boolean value 
- df.innull().sum()  returns number of missing in a columns.

Removing missing values.
- df.dropna() # remove all whole row if a single column contains NaN/ None value
- df.dropna(axis = 1) # this remove the whole the whole column if a single value in that column contain NaN/None.


Filling the NaN / None values.
- df.fillna(5) # every missing will aquire the 5 as their defaulf value.
- filling NaN/ None values by mean, std, or any other statistical vlaues
    - df["Age"].fillna(df['Age'].mean())

In [30]:
data ={
    "employee_ID"  : ['EMP001',None,'EMP003','EMP004','EMP005','EMP006',None,'EMP008',"EMP009",'EMP010','EMP011','EMP012','EMP013'],
    'Name': ['ram', None,'rahul','mohit', 'susheel','ajay','satyam',None, 'anshika', 'pranjali', 'akhand', 'ankanksha','sneha'],
    "Age": [21,None, 22,23,34,25,35,22,None,52,22,25,None],
    "salary": [45000,None,23000,45000,50000,42000,52000,51000,None,48000,48000,49000,51000]
    }

df_2 = pd.DataFrame(data)
print(df_2)

   employee_ID       Name   Age   salary
0       EMP001        ram  21.0  45000.0
1         None       None   NaN      NaN
2       EMP003      rahul  22.0  23000.0
3       EMP004      mohit  23.0  45000.0
4       EMP005    susheel  34.0  50000.0
5       EMP006       ajay  25.0  42000.0
6         None     satyam  35.0  52000.0
7       EMP008       None  22.0  51000.0
8       EMP009    anshika   NaN      NaN
9       EMP010   pranjali  52.0  48000.0
10      EMP011     akhand  22.0  48000.0
11      EMP012  ankanksha  25.0  49000.0
12      EMP013      sneha   NaN  51000.0

In [31]:
df_2.isnull()

    employee_ID   Name    Age  salary
0         False  False  False   False
1          True   True   True    True
2         False  False  False   False
3         False  False  False   False
4         False  False  False   False
5         False  False  False   False
6          True  False  False   False
7         False   True  False   False
8         False  False   True    True
9         False  False  False   False
10        False  False  False   False
11        False  False  False   False
12        False  False   True   False

In [32]:
df_2.isnull().sum()

employee_ID    2
Name           2
Age            3
salary         2
dtype: int64

In [33]:
df_2.dropna() # row 1, 6, 7, 8, 12 is removed from the data frame

   employee_ID       Name   Age   salary
0       EMP001        ram  21.0  45000.0
2       EMP003      rahul  22.0  23000.0
3       EMP004      mohit  23.0  45000.0
4       EMP005    susheel  34.0  50000.0
5       EMP006       ajay  25.0  42000.0
9       EMP010   pranjali  52.0  48000.0
10      EMP011     akhand  22.0  48000.0
11      EMP012  ankanksha  25.0  49000.0

In [34]:
df_2['salary'].fillna(df['salary'].mean()) # "salary" column cointaing NaN/None values are updated by the mean of the column.

0     45000.000000
1     52892.307692
2     23000.000000
3     45000.000000
4     50000.000000
5     42000.000000
6     52000.000000
7     51000.000000
8     52892.307692
9     48000.000000
10    48000.000000
11    49000.000000
12    51000.000000
Name: salary, dtype: float64

In [35]:
df_2.fillna(5)

   employee_ID       Name   Age   salary
0       EMP001        ram  21.0  45000.0
1            5          5   5.0      5.0
2       EMP003      rahul  22.0  23000.0
3       EMP004      mohit  23.0  45000.0
4       EMP005    susheel  34.0  50000.0
5       EMP006       ajay  25.0  42000.0
6            5     satyam  35.0  52000.0
7       EMP008          5  22.0  51000.0
8       EMP009    anshika   5.0      5.0
9       EMP010   pranjali  52.0  48000.0
10      EMP011     akhand  22.0  48000.0
11      EMP012  ankanksha  25.0  49000.0
12      EMP013      sneha   5.0  51000.0

## Interpolation
- This is a method to fill the missing values in a data frame through estimated vales.

like we have data:

[10, 20, 30, None, 50, 60].

so by the help to interpolation $missing$ data will automatically get the value $40$.

- Methods in interpolation: Interpolation consist of many methods like: linear, quadratic, cubic, time and their many other interpolation methods.
- There is catch with interpolation. It required numerical data.

In [36]:
x = {
    'time': [1,2,3,4,5],
    'values': [10, None, 30, 40, 50]
}
df_4 = pd.DataFrame(x)
print(df_4)

   time  values
0     1    10.0
1     2     NaN
2     3    30.0
3     4    40.0
4     5    50.0

In [37]:
df_4["values"] = df_4['values'].interpolate(method='linear')
print(df_4)
print("Here we get the estimated value for the NaN.")

   time  values
0     1    10.0
1     2    20.0
2     3    30.0
3     4    40.0
4     5    50.0
Here we get the estimated value for the NaN.

# Organising a data
- sorting
    - df.sort_values(by="column_name", ascending=True/False). # you use $inplace=True$ for changing the original data frame
    - for performing sorting in multiple columns.
        - df.sort_values(by=['column_1', 'column_2', '...'], accending= [True, Flase, ... True/False]) # the number of True/False should shame as the number of colomn passed for the sorting.
- filtering

In [40]:
student = { 'Name': ['ram', 'syam','rahul','mohit', 'susheel','ajay','satyam','naveen', 'anshika', 'pranjali', 'akhand', 'ankanksha','sneha'],
    'class': [10,9,10,12,10,12,11,11,11,9,9,12,11],
    "Age": [21,22,32,23,34,25,35,22,23,52,22,25,23],
    "Total Marks": [450, 250, 300, 430, 432, 332, 438, 421, 215, 275, 315, 302, 499] 
}

In [41]:
std_df = pd.DataFrame(student)
print(std_df)

         Name  class  Age  Total Marks
0         ram     10   21          450
1        syam      9   22          250
2       rahul     10   32          300
3       mohit     12   23          430
4     susheel     10   34          432
5        ajay     12   25          332
6      satyam     11   35          438
7      naveen     11   22          421
8     anshika     11   23          215
9    pranjali      9   52          275
10     akhand      9   22          315
11  ankanksha     12   25          302
12      sneha     11   23          499

In [ ]:
std_df.sort_values(by='Name', ascending= True)

         Name  class  Age  Total Marks
5        ajay      8   25          332
10     akhand      9   22          315
11  ankanksha     12   25          302
8     anshika      8   23          215
3       mohit      5   23          430
7      naveen      8   22          421
9    pranjali      9   52          275
2       rahul      8   32          300
0         ram      6   21          450
6      satyam      6   35          438
12      sneha     11   23          499
4     susheel      6   34          432
1        syam      7   22          250

In [ ]:
print(std_df)

         Name  class  Age  Total Marks
0         ram      6   21          450
1        syam      7   22          250
2       rahul      8   32          300
3       mohit      5   23          430
4     susheel      6   34          432
5        ajay      8   25          332
6      satyam      6   35          438
7      naveen      8   22          421
8     anshika      8   23          215
9    pranjali      9   52          275
10     akhand      9   22          315
11  ankanksha     12   25          302
12      sneha     11   23          499

In [ ]:
std_df.sort_values(by='Name', ascending= True, inplace=True)
print(std_df)

         Name  class  Age  Total Marks
5        ajay      8   25          332
10     akhand      9   22          315
11  ankanksha     12   25          302
8     anshika      8   23          215
3       mohit      5   23          430
7      naveen      8   22          421
9    pranjali      9   52          275
2       rahul      8   32          300
0         ram      6   21          450
6      satyam      6   35          438
12      sneha     11   23          499
4     susheel      6   34          432
1        syam      7   22          250

# Grouping 
Grouping help us to keep the same categorical data together.

like: 
- df.groupby('column_name').['column_name'].sum()

Lets see what going on here in the basis on an example:
- std_df.groupby('Age')['Total Marks'].sum()
firstly it collect all the commom values, like age group of same class (9,10,11,12). then it performs operation over next column (like: mean, sum, std, etc)

In [42]:
group = std_df.groupby("class")['Total Marks'].mean() # calulate the mean marks obtained by each class.
print(group)

class
9     280.000000
10    394.000000
11    393.250000
12    354.666667
Name: Total Marks, dtype: float64

In [ ]:
group = std_df.groupby(["class",'Name'])['Total Marks'].sum() # multiple grouping
print(group)

class  Name
9      akhand       315
       pranjali     275
       syam         250
10     rahul        300
       ram          450
       susheel      432
11     anshika      215
       naveen       421
       satyam       438
       sneha        499
12     ajay         332
       ankanksha    302
       mohit        430
Name: Total Marks, dtype: int64